Tekla Open API Reference for Tekla Structures 2025
RebarSpacingZone.Spacing Property
 Gets or sets the proposed spacing (the space between each reinforcing bar centerline) in the spacing zone.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Spacing { get; set; }
Public Property Spacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarSpacingZone Class
Tekla.Structures.Model Namespace